GopalSaraf/Practicals/PSDL/include/proc/pic16lf18856.h
// Register: CCDNC
#define CCDNC CCDNC
extern volatile unsigned char           CCDNC               __at(0xF56);
#ifndef _LIB_BUILD
asm("CCDNC equ 0F56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDNC0                 :1;
        unsigned CCDNC1                 :1;
        unsigned CCDNC2                 :1;
        unsigned CCDNC3                 :1;
        unsigned CCDNC4                 :1;
        unsigned CCDNC5                 :1;
        unsigned CCDNC6                 :1;
        unsigned CCDNC7                 :1;
    };
} CCDNCbits_t;
extern volatile CCDNCbits_t CCDNCbits __at(0xF56);
// bitfield macros
#define _CCDNC_CCDNC0_POSN                                  0x0
#define _CCDNC_CCDNC0_POSITION                              0x0
#define _CCDNC_CCDNC0_SIZE                                  0x1
#define _CCDNC_CCDNC0_LENGTH                                0x1
#define _CCDNC_CCDNC0_MASK                                  0x1
#define _CCDNC_CCDNC1_POSN                                  0x1
#define _CCDNC_CCDNC1_POSITION                              0x1
#define _CCDNC_CCDNC1_SIZE                                  0x1
#define _CCDNC_CCDNC1_LENGTH                                0x1
#define _CCDNC_CCDNC1_MASK                                  0x2
#define _CCDNC_CCDNC2_POSN                                  0x2
#define _CCDNC_CCDNC2_POSITION                              0x2
#define _CCDNC_CCDNC2_SIZE                                  0x1
#define _CCDNC_CCDNC2_LENGTH                                0x1
#define _CCDNC_CCDNC2_MASK                                  0x4
#define _CCDNC_CCDNC3_POSN                                  0x3
#define _CCDNC_CCDNC3_POSITION                              0x3
#define _CCDNC_CCDNC3_SIZE                                  0x1
#define _CCDNC_CCDNC3_LENGTH                                0x1
#define _CCDNC_CCDNC3_MASK                                  0x8
#define _CCDNC_CCDNC4_POSN                                  0x4
#define _CCDNC_CCDNC4_POSITION                              0x4
#define _CCDNC_CCDNC4_SIZE                                  0x1
#define _CCDNC_CCDNC4_LENGTH                                0x1
#define _CCDNC_CCDNC4_MASK                                  0x10
#define _CCDNC_CCDNC5_POSN                                  0x5
#define _CCDNC_CCDNC5_POSITION                              0x5
#define _CCDNC_CCDNC5_SIZE                                  0x1
#define _CCDNC_CCDNC5_LENGTH                                0x1
#define _CCDNC_CCDNC5_MASK                                  0x20
#define _CCDNC_CCDNC6_POSN                                  0x6
#define _CCDNC_CCDNC6_POSITION                              0x6
#define _CCDNC_CCDNC6_SIZE                                  0x1
#define _CCDNC_CCDNC6_LENGTH                                0x1
#define _CCDNC_CCDNC6_MASK                                  0x40
#define _CCDNC_CCDNC7_POSN                                  0x7
#define _CCDNC_CCDNC7_POSITION                              0x7
#define _CCDNC_CCDNC7_SIZE                                  0x1
#define _CCDNC_CCDNC7_LENGTH                                0x1
#define _CCDNC_CCDNC7_MASK                                  0x80

// Register: CCDPC
#define CCDPC CCDPC
extern volatile unsigned char           CCDPC               __at(0xF57);
#ifndef _LIB_BUILD
asm("CCDPC equ 0F57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCDPC0                 :1;
        unsigned CCDPC1                 :1;
        unsigned CCDPC2                 :1;
        unsigned CCDPC3                 :1;
        unsigned CCDPC4                 :1;
        unsigned CCDPC5                 :1;
        unsigned CCDPC6                 :1;
        unsigned CCDPC7                 :1;
    };
} CCDPCbits_t;
extern volatile CCDPCbits_t CCDPCbits __at(0xF57);
// bitfield macros
#define _CCDPC_CCDPC0_POSN                                  0x0
#define _CCDPC_CCDPC0_POSITION                              0x0
#define _CCDPC_CCDPC0_SIZE                                  0x1
#define _CCDPC_CCDPC0_LENGTH                                0x1
#define _CCDPC_CCDPC0_MASK                                  0x1
#define _CCDPC_CCDPC1_POSN                                  0x1
#define _CCDPC_CCDPC1_POSITION                              0x1
#define _CCDPC_CCDPC1_SIZE                                  0x1
#define _CCDPC_CCDPC1_LENGTH                                0x1
#define _CCDPC_CCDPC1_MASK                                  0x2
#define _CCDPC_CCDPC2_POSN                                  0x2
#define _CCDPC_CCDPC2_POSITION                              0x2
#define _CCDPC_CCDPC2_SIZE                                  0x1
#define _CCDPC_CCDPC2_LENGTH                                0x1
#define _CCDPC_CCDPC2_MASK                                  0x4
#define _CCDPC_CCDPC3_POSN                                  0x3
#define _CCDPC_CCDPC3_POSITION                              0x3
#define _CCDPC_CCDPC3_SIZE                                  0x1
#define _CCDPC_CCDPC3_LENGTH                                0x1
#define _CCDPC_CCDPC3_MASK                                  0x8
#define _CCDPC_CCDPC4_POSN                                  0x4
#define _CCDPC_CCDPC4_POSITION                              0x4
#define _CCDPC_CCDPC4_SIZE                                  0x1
#define _CCDPC_CCDPC4_LENGTH                                0x1
#define _CCDPC_CCDPC4_MASK                                  0x10
#define _CCDPC_CCDPC5_POSN                                  0x5
#define _CCDPC_CCDPC5_POSITION                              0x5
#define _CCDPC_CCDPC5_SIZE                                  0x1
#define _CCDPC_CCDPC5_LENGTH                                0x1
#define _CCDPC_CCDPC5_MASK                                  0x20
#define _CCDPC_CCDPC6_POSN                                  0x6
#define _CCDPC_CCDPC6_POSITION                              0x6
#define _CCDPC_CCDPC6_SIZE                                  0x1
#define _CCDPC_CCDPC6_LENGTH                                0x1
#define _CCDPC_CCDPC6_MASK                                  0x40
#define _CCDPC_CCDPC7_POSN                                  0x7
#define _CCDPC_CCDPC7_POSITION                              0x7
#define _CCDPC_CCDPC7_SIZE                                  0x1
#define _CCDPC_CCDPC7_LENGTH                                0x1
#define _CCDPC_CCDPC7_MASK                                  0x80

// Register: WPUE
#define WPUE WPUE
extern volatile unsigned char           WPUE                __at(0xF65);
#ifndef _LIB_BUILD
asm("WPUE equ 0F65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned WPUE3                  :1;
    };
} WPUEbits_t;
extern volatile WPUEbits_t WPUEbits __at(0xF65);
// bitfield macros
#define _WPUE_WPUE3_POSN                                    0x3
#define _WPUE_WPUE3_POSITION                                0x3
#define _WPUE_WPUE3_SIZE                                    0x1
#define _WPUE_WPUE3_LENGTH                                  0x1
#define _WPUE_WPUE3_MASK                                    0x8

// Register: INLVLE
#define INLVLE INLVLE
extern volatile unsigned char           INLVLE              __at(0xF68);
#ifndef _LIB_BUILD
asm("INLVLE equ 0F68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned INLVLE3                :1;
    };
} INLVLEbits_t;
extern volatile INLVLEbits_t INLVLEbits __at(0xF68);
// bitfield macros
#define _INLVLE_INLVLE3_POSN                                0x3
#define _INLVLE_INLVLE3_POSITION                            0x3
#define _INLVLE_INLVLE3_SIZE                                0x1
#define _INLVLE_INLVLE3_LENGTH                              0x1
#define _INLVLE_INLVLE3_MASK                                0x8

// Register: IOCEP
#define IOCEP IOCEP
extern volatile unsigned char           IOCEP               __at(0xF69);
#ifndef _LIB_BUILD
asm("IOCEP equ 0F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEP3                 :1;
    };
} IOCEPbits_t;
extern volatile IOCEPbits_t IOCEPbits __at(0xF69);
// bitfield macros
#define _IOCEP_IOCEP3_POSN                                  0x3
#define _IOCEP_IOCEP3_POSITION                              0x3
#define _IOCEP_IOCEP3_SIZE                                  0x1
#define _IOCEP_IOCEP3_LENGTH                                0x1
#define _IOCEP_IOCEP3_MASK                                  0x8

// Register: IOCEN
#define IOCEN IOCEN
extern volatile unsigned char           IOCEN               __at(0xF6A);
#ifndef _LIB_BUILD
asm("IOCEN equ 0F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned IOCEN3                 :1;
    };
} IOCENbits_t;
extern volatile IOCENbits_t IOCENbits __at(0xF6A);
// bitfield macros
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8

